#include "Goal.h"

Goal::Goal(Vec2f pos_)
{
  pos = pos_;
  SetUp();
}

//-------------------------------------------//
//                 初期化                    //
//-------------------------------------------//
void Goal::SetUp()
{
  color = Color::red;
  size = Vec2f(MAPCHIP_SIZE, MAPCHIP_SIZE);
}

//-------------------------------------------//
//               全体の更新                   //
//-------------------------------------------//
void Goal::Update()
{

}


//-------------------------------------------//
//               全体の描画                   //
//-------------------------------------------//
void Goal::Draw()
{
  drawFillBox(pos.x(), pos.y(), size.x(), size.y(), color);
}